/*
 *<<希尔排序>>
 *    希尔排序通过比较相距一定间隔的元素，即形如L[i,i+d,i+2d,...i+kd]的序列
 *然后缩小间距，再对各分组序列进行排序。直到只比较相邻元素的最后一趟排序为
 *止，即最后的间距为1。希尔排序有时也叫做 *<<缩小增量排序>>*
 *****时间复杂度：依赖于增量序列的选择，但最坏情况才为O(N^2)
 *****空间复杂度：O(1)
 *****稳定性：不稳定
 */
#include <stdio.h>
int main(void)
{
	int A[7] = {1,4,5,8,9,6,3};
    int i, j, dk, t;   // dk是增量
     
    for(dk=7/2; dk>0; dk/=2)  // 增量变化
    {
        for(i=dk; i<7; ++i)  // 每个分组序列进行直接插入排序
        {
            t = A[i];
            for(j=i-dk; j>=0 && A[j]>t; j-=dk)
                A[j+dk] = A[j];  // 后移
            A[j+dk] = t;
        }
    }
	for (i=0; i<7; i++)
		printf("%-2d",A[i]);
	printf("\n");

	return 0;
}