/*
 *<<简单选择排序>>
 *    选择排序的算法思想很简单，假设序列为L[n]，第i趟排序即从L[i...n]中选择
 *最小的元素与L(i)交换，每一趟排序可以确定一个元素的最终位置。经过n-1
 *趟排序就可以使得序列有序了。
 *****时间复杂度：始终是O(n^2)
 *****空间复杂度：O(1)
 *****稳定性：不稳定
 */
#include <stdio.h>
int main(void)
{
	int a[7] = {1,4,5,8,9,6,3};
	int i, j, k, t;
	
	for (i=0; i<7; ++i)
	{
		k=i;	//给记号赋值
		for (j=i+1; j<7; ++j)
			if (a[k]>a[j])
				k = j;		//k总指向最小元素
		if (i != k)		//当k != i时才交换，否则a[i]即为最小
		{
			t = a[i];
			a[i] = a[k];
			a[k] = t;
		}
	}
	for (i=0; i<7; i++)
		printf("%-2d",a[i]);
	printf("\n");
	return 0;
}
